Repository: naden01/test
Catalog: lib/l10n/app_*.arb
Languages: es, id, ja, ru

# by
source: By: Kanagawa Yamada
es: Por: Kanagawa Yamada
id: Oleh: Kanagawa Yamada
ja: 作成者: 神奈川山田

source: Root Access:
es: Acceso Root:
id: Akses Root:
ja: ルートアクセス:
ru: Root-доступ:

source: Module Installed:
es: Módulo Instalado:
id: Modul Terpasang:
ja: モジュール:
ru: Модуль установлен:

source: Module Version:
es: Versión de Módulo:
id: Versi Modul:
ja: モジュールバージョン:
ru: Версия модуля:

# module_not_installed
source: Not Installed
es: No Instalado
id: Tidak Terpasang
ja: インストールされていません
ru: Модуль не установлен

source: Current Mode:
es: Perfil Actual:
id: Mode Saat Ini:
ja: 現在のモード:
ru: Текущий режим:

source: Select Language:
es: Selecciona tu lenguaje:
id: Pilih Bahasa:
ja: 言語を選択:
ru: Выбрать язык:

# power_save_desc
source: Prioritizing Battery Over Performance
es: Priorizar eficiencia sobre rendimiento
id: Memprioritaskan Baterai Di Atas Performa
ja: バッテリーを優先（パフォーマンス最小）
ru: Приоритет батареи над производительностью

# balanced_desc
source: Balance Battery and Performance
es: Equilibrar eficiencia y rendimiento
id: Seimbangkan Baterai dan Performa
ja: バッテリーとパフォーマンスのバランス
ru: Баланс батареи и производительности

# performance_desc
source: Prioritizing Performance Over Battery
es: Priorizar rendimiento sobre eficiencia
id: Memprioritaskan Performa Di Atas Baterai
ja: パフォーマンスを優先（バッテリー最小）
ru: Приоритет производительности над батарей

# clear_desc
source: Clear RAM By Killing All Apps
es: Limpiar la ram a través de cerrar procesos
id: Bersihkan RAM Dengan Membunuh Semua Aplikasi
ja: すべてのアプリを終了してRAMをクリア
ru: Отчистка RAM путём убийства фоновых приложений

# cooldown_desc
source: Cool Down Your Device (Let It Rest for 2 Minutes)
es: Enfriar tu dispositivo (Dejalo descansar por 2 minutos)
id: Dinginkan Perangkat Anda (Biarkan Beristirahat Selama 2 Menit)
ja: デバイスを冷却 (2分間休ませる)
ru: Охлаждаю устройство (Дайте отдохнуть ему 2 минты)

# gaming_desc
source: Set to Performance and Kill All Apps
es: Cambie a rendimiento y termine procesos para liberar más RAM
id: Atur ke Performa dan Bunuh Semua Aplikasi
ja: パフォーマンスモードですべてのアプリを終了
ru: Установка режима производительности и убийство ВСЕХ запущенных приложений

source: Power Save
es: Ahorro de batería
id: Hemat Daya
ja: 省電力
ru: Энергосбережение

source: Balanced
es: Equilibrio
id: Seimbang
ja: バランス
ru: Баланс

source: Performance
es: Rendimiento
id: Performa
ja: パフォーマンス
ru: Производительность

source: Clear
es: Limpiar
id: Bersihkan
ja: クリア
ru: Отчистить

source: Cool Down
es: Enfriar
id: Dinginkan
ja: 冷却
ru: Охлаждение

source: Gaming Pro
id: Pro Gaming
ja: ゲーミングプロ
ru: Игровой режим

# about_title
source: Thank you for the great people who helped improve Project Raco:
es: Gracias a toda la maravillosa gente que ayuda a mejorar Project Raco:
id: Terima kasih kepada orang-orang hebat yang membantu memperbaiki Project Raco:
ja: Project Racoの改善に協力してくれた素晴らしい人々に感謝します:
ru: Спасибо всем, кто помог сделать Project Raco таким , каким вы его сейчас видите:

# about_quote
source: "Great Collaboration Lead to Great Innovation" ~ Kanagawa Yamada (Main Dev)
es: "Grande colaboración lleva a grande innovación!" ~ Kanagawa Yamada (Principal desarrollador)
id: "Kolaborasi Hebat Mengarah pada Inovasi Hebat" ~ Kanagawa Yamada (Pengembang Utama)
ja: "偉大なコラボレーションは偉大なイノベーションにつながる" ~ 神奈川山田 (メイン開発者)
ru: "Отличное сотрудничество приводит к отличным инновациям" ~ Kanagawa Yamada (главный разработчик)

# about_note
source: Project Raco Is Always Free, Open Source, and Open For Improvement
es: Project Raco es grátis, código abierto y libre para modificar y mejorar!
id: Project Raco Selalu Gratis, Sumber Terbuka, dan Terbuka untuk Peningkatan
ja: Project Racoは常に無料、オープンソース、そして改善に開かれています
ru: Project Raco всегда будет бесплатен, с открытым исходным кодом, и открытым для улучшений

# credits_10
source: And All Testers That I Can't Mentioned One by One
es: Y a todos los testers que aportaron su feedback!
id: Dan Semua Penguji yang Tidak Bisa Disebutkan Satu per Satu
ja: 名前を挙げられなかったすべてのテスター
ru: И всем тестерам, которых я не могу упомянуть

source: Yes
es: Sí
id: Ya
ja: はい
ru: Да

source: No
id: Tidak
ja: いいえ
ru: Нет

source: Utilities
es: Utilidades
id: Utilitas
ja: ユーティリティ
ru: Утилиты

# utilities_title
source: Utilities
es: Utilidades
id: Utilitas
ja: ユーティリティ
ru: Утилиты

source: Search Utilities
es: Buscar utilidades
id: Cari Utilitas
ja: ユーティリティを検索
ru: Найти утилиты

# core_tweaks_title
source: Core Tweaks
es: Tweaks principales
id: Tweak Inti
ja: コア調整
ru: Основные твики

# automation_title
source: Automation
es: Automatización
id: Otomatisasi
ja: 自動化
ru: Автоматически

# system_title
source: System
es: Sistema
id: Sistem
ja: システム
ru: Система

# appearance_title
source: Appearance
es: Apariencia
id: Tampilan
ja: 外観
ru: Внешний вид

# fix_and_tweak_title
source: Fix and Tweak
es: Arreglo y tweaks
id: Perbaikan & Tweak
ja: 修正と調整
ru: Фиксы и твики

# device_mitigation_title
source: Device Mitigation
es: Mitigación del dispositivo
id: Mitigasi Perangkat
ja: デバイスの緩和
ru: Смягчение фризов

# device_mitigation_description
source: Turn on if you experience screen freeze
es: Enciendelo si experimentas congelado de pantalla
id: Nyalakan jika Anda mengalami layar beku
ja: 画面のフリーズが発生した場合にオンにします
ru: Включите это, если ваш экран имеет подтормаживания

# lite_mode_title
source: LITE Mode
es: Modo lite
id: Mode LITE
ja: ライトモード
ru: Легкий режим

# lite_mode_description
source: Using Lite mode (Requested by Fans)
es: Usar modo lite (Solicitado por fans)
id: Menggunakan mode Lite (Diminta oleh Penggemar)
ja: ライトモードを使用する（ファンによるリクエスト）
ru: Лёгкий режим (По просьбе фанатов)

# hamada_ai_description
source: Automatically Switch to Performance When Entering Game
es: Autmáticamente cambia a modo Rendimiento cuando se inicie un juego.
id: Otomatis Beralih ke Performa Saat Memasuki Game
ja: ゲーム開始時に自動でパフォーマンスモードに切り替え
ru: Автоматически меняет режим на Производительность, когда открывается игра

source: Downscale Resolution
es: Disminuir la resolución
id: Turunkan Resolusi
ja: 解像度を下げる
ru: Понизить резрешение

source: Selected: {resolution}
es: Seleccionado: {resolution}
id: Terpilih: {resolution}
ja: 選択済み: {resolution}
ru: Выбранное разрешение: {resolution}

# reset_resolution
source: Reset to Original
es: Restablecer valores originales
id: Kembali ke Asli
ja: オリジナルに戻す
ru: Вернуться к родному разрешению

# hamada_ai_toggle_title
source: Enable HAMADA AI
es: Activar HAMADA AI
id: Aktifkan HAMADA AI
ja: HAMADA AI を有効にする
ru: Включить HAMADA AI

# hamada_ai_start_on_boot
source: Start on Boot
es: Iniciar al arrancar
id: Mulai saat Boot
ja: 起動時に開始
ru: Запускать при загрузке устройтсва

# edit_game_txt_title
source: Edit game.txt
es: Editar game.txt
ja: game.txt を編集
ru: Изменить game.txt

source: Sync Changes
es: Sincronizar cambios
id: Sinkronkan Perubahan
ja: 変更を同期
ru: Синхронизовать изменения

# save_button
source: Save
es: Guardar
id: Simpan
ja: 保存
ru: Сохранить

# executing_command
source: Executing...
es: Ejecutando...
id: Menjalankan...
ja: 実行中...
ru: Выполнение...

source: Command executed.
es: Comando ejecutado.
id: Perintah dijalankan.
ja: コマンドが実行されました。
ru: Команда выполнена Успешно.

source: Command failed.
es: Comando fallido.
id: Perintah gagal.
ja: コマンドが失敗しました。
ru: Ошибка.

# saving_file
source: Saving...
es: Guardando...
id: Menyimpan...
ja: 保存中...
ru: Сохранение...

source: File saved.
es: Archivo guardado.
id: File disimpan.
ja: ファイルが保存されました。
ru: Файл сохранён.

# file_save_failed
source: Failed to save file.
es: Fallo al guardar archivo.
id: Gagal menyimpan file.
ja: ファイルの保存に失敗しました。
ru: Ошибка сохранения файла.

source: Reading file...
es: Leyendo archivo...
id: Membaca file...
ja: ファイルを読み込み中...
ru: Чтение файла...

# file_read_failed
source: Failed to read file.
es: Fallo al leer el archivo.
id: Gagal membaca file.
ja: ファイルの読み込みに失敗しました。
ru: Ошибка чтения файла.

# writing_service_file
source: Updating boot script...
es: Actualizando script de arranque...
id: Memperbarui skrip boot...
ja: ブートスクリプトを更新中...
ru: Обновление скрипта запуска...

# service_file_updated
source: Boot script updated.
es: Script de arranque actualizado.
id: Skrip boot diperbarui.
ja: ブートスクリプトが更新されました。
ru: Скрипт запуска обновлён.

# service_file_update_failed
source: Failed to update boot script.
es: Fallo al actualizar el script de arranque.
id: Gagal memperbarui skrip boot.
ja: ブートスクリプトの更新に失敗しました。
ru: Ошибка обновления скрипта запуска.

# error_no_root
source: Root access required.
es: Acceso root requerido.
id: Membutuhkan akses root.
ja: ルートアクセスが必要です。
ru: Нужен ROOT доступ.

# error_file_not_found
source: File not found.
es: Archivo no encontrado.
id: File tidak ditemukan.
ja: ファイルが見つかりません。
ru: Файл не найден.

# game_txt_hint
source: Enter game package names, one per line...
es: Escriba el nombre del paquete del juego, uno por linea...
id: Masukkan nama paket game, satu per baris...
ja: ゲームパッケージ名を1行に1つずつ入力...
ru: Введите имена игровых пакетов по одному в каждую строку...

# resolution_unavailable_message
source: Resolution control is not available on this device.
es: Control de resolución no está disponible para este dispositivo.
id: Kontrol resolusi tidak tersedia di perangkat ini.
ja: このデバイスでは解像度制御は利用できません。
ru: Управление разрешением не досутпно на этом устройстве.

source: Applying changes...
es: Aplicando cambios...
id: Menerapkan perubahan...
ja: 変更を適用中...
ru: Применение настроек...

# applying_new_color
source: Applying New Color, Please Wait...
es: Aplicando nuevo color, por favor espere...
id: Menerapkan Warna Baru, Harap Tunggu...
ja: 新しい色を適用しています、お待ちください...
ru: Применение нового цвета, Пожалуйста подождите...

# dnd_title
source: DND Switch
es: Modo no molestar
id: Saklar DND
ja: DND スイッチ
ru: Изменить DND

# dnd_description
source: Automatically Turn DND on / off
es: Automaticamente activa/desactiva modo No Molestar
id: Otomatis Nyalakan / Matikan DND
ja: DND の自動オン/オフ切り替え
ru: Автоматический переключатель DND Включен / Выключен

# dnd_toggle_title
source: Enable DND Auto Switch
es: Activar cambio automático de modo No Molestar
id: Aktifkan Saklar Otomatis DND
ja: DND 自動スイッチを有効にする
ru: Включить автопереключатель DND

# bypass_charging_title
source: Bypass Charging
es: Bypass de carga
ja: バイパス充電
ru: Обходная зарядка

# bypass_charging_description
source: Enable Bypass Charging While in Performance & Gaming Pro on Supported Device
es: Activar Bypass de carga estando en modo Rendimiento & Gaming Pro en dispositivos soportados
id: Aktifkan Bypass Charging Saat Mode Performa & Gaming Pro di Perangkat yang Didukung
ja: サポートされているデバイスでパフォーマンス＆ゲーミングプロ中にバイパス充電を有効にする
ru: Включите обходную зарядку в режиме Производительности & Игровом на поддерживаемом устройстве

# bypass_charging_toggle
source: Enable Bypass Charging
es: Activar Bypass de carga
id: Aktifkan Bypass Charging
ja: バイパス充電を有効にする
ru: Включить обходную зарядку

# bypass_charging_unsupported
source: Bypass charging is not supported on your device
es: Bypass de carga no está soportado para tu dispositivo
id: Bypass charging tidak didukung di perangkat Anda
ja: お使いのデバイスではバイパス充電はサポートされていません
ru: Обходная зарядка не поддреживается на вашем устройстве

# bypass_charging_supported
source: Bypass charging is supported on your device
es: Bypass de carga está soportado para tu dispositivo
id: Bypass charging didukung di perangkat Anda
ja: お使いのデバイスではバイパス充電がサポートされています
ru: Обходная зарядка поддерживается на вашем устройстве

# mode_status_label
source: Mode:
es: Modo:
ja: モード:

# mode_manual
source: Manual
ja: 手動
ru: Ручной

source: Please Disable HamadaAI First
es: Por favor desactive HamadaAI primero
id: Harap Nonaktifkan HamadaAI Terlebih Dahulu
ja: 最初にHamadaAIを無効にしてください
ru: Пожалуйста сначала отключите HamadaAI

# background_settings_title
source: Background Settings
es: Configuración de fondo
id: Pengaturan Latar Belakang
ja: 背景設定
ru: Фоновые настройки

# background_settings_description
source: Customize the app's background image, opacity, and blur effect.
es: Configure la apariencia del fondo, color, opacidad y otros valores más.
id: Sesuaikan gambar latar belakang, opasitas, dan efek blur aplikasi.
ja: アプリの背景画像、不透明度、ぼかし効果をカスタマイズします。
ru: Измените фоновое изображение приложения, непрозрачность, и блюр эффект.

# opacity_slider_label
source: Background Opacity
es: Opacidad de fondo
id: Opasitas Latar Belakang
ja: 背景の不透明度
ru: Непрозрачность фона

# blur_slider_label
source: Background Blur
es: Desenfoque de fondo
id: Tingkat Blur Latar
ja: 背景のぼかし
ru: Блюр заднего фона

# banner_settings_title
source: Banner Settings
es: Configuración de banner
id: Pengaturan Banner
ja: バナー設定
ru: Параметры баннера

# banner_settings_description
source: Customize the main screen's banner image (16:9 aspect ratio).
es: Personalizar el aspecto del banner de la pantalla principal (Imágenes con aspecto 16:9 soportados).
id: Sesuaikan gambar banner layar utama (rasio aspek 16:9).
ja: メイン画面のバナー画像（アスペクト比16:9）をカスタマイズします。
ru: Измените главное изображение (16:9).

source: Device name
es: Nombre de dispositivo
id: Nama perangkat
ja: デバイス名
ru: Имя устройства

source: Processor
es: Procesador
id: Prosesor
ja: プロセッサ
ru: Процессор

source: Phone storage
es: Almacenamiento
id: Penyimpanan telepon
ja: ストレージ
ru: Внутреннее хранилище

source: Battery capacity
es: Capacidad de bateria
id: Kapasitas baterai
ja: バッテリー容量
ru: Ёмкость батареи

# custom_governor_title
source: Custom Governor
es: Governor personalizado
id: Gubernur Kustom
ja: カスタムガバナー
ru: Кастомный Governor

# custom_governor_description
source: Set custom CPU governor, This will set the governor in balanced mode
es: Ajuste su Governor personalizado para su CPU, Esto se pondrá en modo balance
id: Atur gubernur CPU kustom, Ini akan mengatur gubernur dalam mode seimbang
ja: カスタムCPUガバナーを設定します。これにより、バランスモードでガバナーが設定されます
ru: Выбор кастомного ЦПУ governor, Это изменит governor в Баланс режиме

source: Loading governors...
es: Cargando governors...
id: Memuat gubernur...
ja: ガバナーを読み込み中...
ru: Загрузка governors...

# no_governor_selected
source: None
es: Ninguno
id: Tidak Ada
ja: なし
ru: Ничего

# anya_thermal_title
source: Anya Melfissa Disable Thermal
id: Anya Melfissa Nonaktifkan Thermal
ja: アーニャ・メルフィッサ サーマル無効化

# anya_thermal_description
source: Disable Thermal on Performance and Gaming, Enable Thermal on Powersave, Balanced, Cool Down.
es: Deshabilita Thermal en Rendimiento y Gaming, Y habilita Thermal en Eficiencia, Equilibrado y Enfriamiento.
id: Nonaktifkan Thermal pada mode Performa dan Gaming, Aktifkan Thermal pada mode Hemat Daya, Seimbang, dan Dinginkan.
ja: パフォーマンスとゲーミングモードではサーマルを無効化し、省電力、バランス、冷却モードではサーマルを有効化します。
ru: Отключение Thermal в играх, Включите Thermal в Баланс, Энергосберегающем, Охлаждающем режимах.

# anya_thermal_toggle_title
source: Enable Anya Thermal Flowstate
es: Activa Anya Thermal Flowstate
id: Aktifkan Anya Thermal Flowstate
ja: アーニャサーマルフローステートを有効にする
ru: Включить Anya Thermal Flowstate

# system_actions_title
source: System Actions
es: Acciones de sistema
id: Tindakan Sistem
ja: システムアクション
ru: Системные действия

# fstrim_description
source: Trim Android partitions.
es: Recortar particiones de Android.
id: Pangkas partisi Android.
ja: Androidパーティションをトリムします。
ru: Обрезка Android разделов.

# clear_cache_title
source: Clear Cache
es: Limpiar caché
id: Bersihkan Cache
ja: キャッシュをクリア
ru: Отчистка caсhe

# better_powersave_title
source: Better Powersave
es: Mejor eficiencia
id: Powersave Lebih Baik
ja: より良い省電力
ru: Batter Powersave

# better_powersave_description
source: Cap the CPU Freq to Half instead of Minimum Freq (Powersave Mode Only)
es: Limita el CPU a la mitad en vez de frecuencia minima (Solo para Modo Eficiencia)
id: Batasi Freq CPU ke Setengah, bukan Freq Minimum (Hanya Mode Powersave)
ja: CPU周波数を最小ではなく半分に制限します（省電力モードのみ）
ru: Уменьшите частоту процессора наполовину вместо минимальной (только в режиме энергосбережения).

# build_version_title
source: Project Raco: {buildName} Build
es: Project Raco: {buildName} Compilacion
id: Project Raco: Build {buildName}
ja: Project Raco: {buildName} ビルド

# build_by_title
source: Build By: {builderName}
es: Compilacion por: {builderName}
id: Dibuat Oleh: {builderName}
ja: 作成者: {builderName}

source: RAM
es: Memoria RAM
